# Security
cask "bitwarden"

# Browsers
cask "firefox"
cask "google-chrome"

# Fonts
tap "homebrew/cask-fonts"
cask "font-meslo-for-powerline"
cask "font-awesome-terminal-fonts"

# Productivity
brew "fzf"                 # Command-line fuzzy finder
brew "fasd"                # Fast navigation and completion in shell
brew "the_silver_searcher" # Fast search-in-files shell command
cask "flycut"              # Clipboard manager
cask "zoom"                # Video meetings

# Development
brew "git"
brew "tig"                 # TUI for Git
brew "jq"                  # Command-line JSON processor
brew "node@14"
brew "pyenv"
brew "docker"
brew "docker-compose"
brew "awscli"

cask "iterm2"
cask "visual-studio-code"
cask "jetbrains-toolbox"

# Communication
cask "slack"
cask "telegram"

# Entertainment
cask "spotify"
