# Security
cask "bitwarden"

# Browsers
cask "firefox"
cask "google-chrome"

# Fonts
tap "homebrew/cask-fonts"
cask "font-meslo-for-powerline"
cask "font-awesome-terminal-fonts"

# Productivity
brew "fasd"    # Fast navigation and completion in shell
cask "flycut"  # Clipboard manager

# Development
brew "git"
brew "node@14"
brew "pyenv"
brew "docker"
brew "docker-compose"

cask "iterm2"
cask "visual-studio-code"
cask "jetbrains-toolbox"

# Communication
cask "slack"
cask "telegram"

# Entertainment
cask "spotify"
