# Security
cask "bitwarden"

# Browsers
cask "firefox"
cask "google-chrome"

# Productivity
brew "fzf"                 # Command-line fuzzy finder
brew "fasd"                # Fast navigation and completion in shell
brew "the_silver_searcher" # Fast search-in-files shell command
brew "sevenzip"            # 7-Zip file archiver with a high compression ratio
cask "maccy"               # Clipboard manager
cask "zoom"                # Video meetings
cask "notion"              # Note taking and knowledge management
cask "rectangle"           # Manage windows using the keyboard

# Development
brew "git"
brew "tig"                 # TUI for Git
brew "jq"                  # Command-line JSON processor
brew "node@14"
brew "pyenv"
brew "awscli"
cask "aws-vault"
cask "docker"
brew "docker-compose"

cask "iterm2"
cask "visual-studio-code"
cask "jetbrains-toolbox"

# Communication
cask "slack"
cask "telegram"
cask "whatsapp"

# Entertainment
cask "spotify"
cask "iina"                 # Advanced video player

# Fonts
tap "homebrew/cask-fonts"
cask "font-fira-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-hasklug-nerd-font"
cask "font-jetbrains-mono-nerd-font"
